app/controllers/stocks_controller.rb

  def index
    respond_with Stock.all
---
SELECT "stocks".* FROM "stocks"

  def create
    respond_with Stock.create(stock_params)
---
INSERT INTO "stocks" ("ask", "created_at", "name", "symbol", "updated_at", "year_high", "year_low") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
   respond_with Stock.destroy(params[:id])
---
DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 1]]

  def ohlc
    stock = Stock.find(params[:stock_id])
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT 1  [["id", "9"]]